//Oop1

//1)클래스란?
// 클래스란 객체(인스턴스)를 생성하는 하나의 공장(=틀,프레임,템플릿,판형 등)이다.
//예시로 시골 허허 벌판에 농기계를 만들어내는 공장(class)이 들어섰고 농부들이 주문을 넣으면 농기계가 만들어져 나온다 >그게 바로 "객체"
//ex) 자동차 클래스(공장) 동물 클래스(공장) 로본 클래스(공장) 만들고 싶은거 다 만들 수 있다.

//2) 클래스 공장을 통해서 객체를 어떻게 만들어내는가?
//사람들이 공장에 주문을 넣는 과정을 생각해보면 답은 쉽게 나온다.
// 예를 들면, 어떤 농부가 경작용 트랙터를 주문한다고 하면 가격,색상,연식 등을 고민할 것이다.
//뿐만 아니라 트렉터의 기능이나 성능 등 동작들에 대해서도 많은 고민을 할 것이다.
// 고민하는 걸 2개 정도로 압축하면 크게 봣을 때 "특징" "동작"이 된다.
// 클래스는 이러한 만들고자 하는 객체의 "특징" 과 "동작" 에 많은 시간을 들이고 집중하면서 설계를 하게된다.

//3) 위 사항들을 조금은 어려운 말로 정의해본다면?
// 객체의 특징 > 속성(attribute)
// 객체의 동작 > 메서드(method) > 함수와 거의 동일.
//참고로 파이썬에서는 일반적으로 함수라는 표현을 쓰지만, 클래스 내에서의 함수는 메서드라고 부른다. 거의 함수와 동일하다.


